Revit 2024 API
SpacingRule Methods
The SpacingRule type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLayoutFixedDistance
Set the Layout property to FixedDistance.
SetLayoutFixedNumber
Set the Layout property to FixedNumber.
SetLayoutMaximumSpacing
Set the Layout property to MaximumSpacing.
SetLayoutMinimumSpacing
Set the Layout property to MinimumSpacing.
SetLayoutNone
Set the Layout property to None.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
SpacingRule Class
Autodesk.Revit.DB Namespace